# NoFaceForSplit Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FaceSplitterFailures..::..NoFaceForSplit Property
BuiltInFailures..::..FaceSplitterFailures Class See Also
---
The highlighted element no longer contains a face that has been split by highlighted sketch.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoFaceForSplit { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoFaceForSplit As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoFaceForSplit {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FaceSplitterFailures Class
Autodesk.Revit.DB Namespace